## Task

In [9]:
#Create a data frame with 4 columns 4 rows
import pandas as pd
x=[[1,2,3,4],[4,5,6,7],[7,8,9,10],[10,11,12,13]]
y=pd.DataFrame(x,index=["0","1","2","3"],columns=["a","b","c","d"])
y

    a   b   c   d
0   1   2   3   4
1   4   5   6   7
2   7   8   9  10
3  10  11  12  13

In [10]:
#print all Columns form your data frame
y.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [11]:
#print all rows from your data frame
y.loc[:]

    a   b   c   d
0   1   2   3   4
1   4   5   6   7
2   7   8   9  10
3  10  11  12  13

In [12]:
#print Second  column in your data frame
y.loc[:,["b"]]

    b
0   2
1   5
2   8
3  11

In [13]:
#print last 2 columns from your data Frame
y.loc[:,["c","d"]]

    c   d
0   3   4
1   6   7
2   9  10
3  12  13

In [14]:
#print  fourth row from your data Frame
y.iloc[3:]

    a   b   c   d
3  10  11  12  13

In [15]:
#print first 2  Rows from your data Frame
y.iloc[0:2]

   a  b  c  d
0  1  2  3  4
1  4  5  6  7

In [16]:
#print all rows and first 2 columns from your data Frame
y.loc[:,["a","b"]]

    a   b
0   1   2
1   4   5
2   7   8
3  10  11

In [17]:
#Delete any row from your data Frame
y.drop("3")

   a  b  c   d
0  1  2  3   4
1  4  5  6   7
2  7  8  9  10

In [18]:
#Delete any column from your data Frame
y.pop("d")

0     4
1     7
2    10
3    13
Name: d, dtype: int64

In [19]:
#Add a column to a Data Frame
new=[14,15,16,17]
y['r']=new
print(pd.DataFrame(y))

    a   b   c   r
0   1   2   3  14
1   4   5   6  15
2   7   8   9  16
3  10  11  12  17

In [22]:
#Iterate all Columns  in your Data Frame and print result
new={'a':19,'b':20,'c':21,'r':22}
x=pd.DataFrame(new,index=[4])
y=pd.concat([x,y])
y

    a   b   c   r
4  19  20  21  22
0   1   2   3  14
1   4   5   6  15
2   7   8   9  16
3  10  11  12  17

In [23]:
#Iterate all Columns  in your Data Frame and print result
for i in y:
    print(i)

a
b
c
r

In [24]:
#Iterate the 3rd column values  of your Data frame and print result.
s=y.pop("c")
for i in s:
    print(i)

21
3
6
9
12

In [26]:
#Iterate all Rows  in your Data Frame and print result
for i in y.iterrows():
    print(i)

(4, a    19
b    20
r    22
Name: 4, dtype: int64)
('0', a     1
b     2
r    14
Name: 0, dtype: int64)
('1', a     4
b     5
r    15
Name: 1, dtype: int64)
('2', a     7
b     8
r    16
Name: 2, dtype: int64)
('3', a    10
b    11
r    17
Name: 3, dtype: int64)

In [34]:
#Read income.csv  file and print as Data Frame
file="income.csv"
import pandas
x=pandas.read_csv(file)
x

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [35]:
#Get 2006 column  info from your data Frame by using drop
x.drop(columns=["2006"],axis=1)

,GEOID,State,2005,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55734,57014,56134,54283,53367,57020,57528